Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection.AnalysisSubSections Property
 The subsections of the analysis cross section.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisSubSection> AnalysisSubSections { get; set; }
Public Property AnalysisSubSections As List(Of AnalysisSubSection)
	Get
	Set
Property Value
Type: List<AnalysisSubSection>
See Also
Reference
AnalysisCrossSection Class
Tekla.Structures.Analysis Namespace